In [1]:
# create datframe using list

In [2]:
import pandas as pd

In [3]:
list=['a','1',55,'ahdsg',[1,5,'l']]
list

['a', '1', 55, 'ahdsg', [1, 5, 'l']]

In [6]:
list_df=pd.DataFrame(list)
list_df

           0
0          a
1          1
2         55
3      ahdsg
4  [1, 5, l]

In [9]:
dict={
    'key':'value',
    'list_key':[1,5,'j'],
}
dict

{'key': 'value', 'list_key': [1, 5, 'j']}

In [10]:
dict_df=pd.DataFrame(dict)
dict_df

     key list_key
0  value        1
1  value        5
2  value        j

In [ ]:
# rows and columns

In [23]:
# dict nested list data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Age': [27, 24, 22, 32],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
 'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [47]:
# selecting rows
data_df['Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [24]:
data_df=pd.DataFrame(data)
data_df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [25]:
# csv data

In [42]:
csv_data=pd.read_csv("..\data.csv")
csv_data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [43]:
# get row
csv_data.loc[0]

Id                         1
SepalLengthCm            5.1
SepalWidthCm             3.5
PetalLengthCm            1.4
PetalWidthCm             0.2
Species          Iris-setosa
Name: 0, dtype: object

In [45]:
csv_data.iloc[0]

Id                         1
SepalLengthCm            5.1
SepalWidthCm             3.5
PetalLengthCm            1.4
PetalWidthCm             0.2
Species          Iris-setosa
Name: 0, dtype: object

In [44]:
# get columns
csv_data['Species']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Species, Length: 150, dtype: object

In [48]:
# missing data

In [57]:
# importing numpy as np
import numpy as np

In [58]:
dict_data_null_elements= {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
dict_data_null_elements

{'First Score': [100, 90, nan, 95],
 'Second Score': [30, 45, 56, nan],
 'Third Score': [nan, 40, 80, 98]}

In [81]:
dict_data_null_elements_df=pd.DataFrame(dict_data_null_elements)
dict_data_null_elements_df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [82]:
# find missing data

In [83]:
# drop missing values
dict_data_null_elements_df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [85]:
# iterations over rows

In [86]:
for i,j in dict_data_null_elements_df.iterrows():
    print(i,j)
    print()

0 First Score     100.0
Second Score     30.0
Third Score       NaN
Name: 0, dtype: float64

1 First Score     90.0
Second Score    45.0
Third Score     40.0
Name: 1, dtype: float64

2 First Score      NaN
Second Score    56.0
Third Score     80.0
Name: 2, dtype: float64

3 First Score     95.0
Second Score     NaN
Third Score     98.0
Name: 3, dtype: float64

In [96]:
# iterating ovr columns
for i in dict_data_null_elements_df:
    print(dict_data_null_elements_df[i][0])

100.0
30.0
nan